#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackdentech-aws/S3-Demo-Workspace/runs/run-SQT49oVFFTAEAmQm

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.demo_bucket: Refreshing state... [id=demo-bucket-481877421625]
aws_s3_bucket_public_access_block.block_public_access: Refreshing state... [id=demo-bucket-481877421625]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.demo_bucket has changed
  ~ resource "aws_s3_bucket" "demo_bucket" {
        id                                   = "demo-bucket-481877421625"
      + tags                                 = {}
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_acl.demo_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "demo_bucket_acl" {
      + acl    = "private"
      + bucket = "demo-bucket-481877421625"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.demo_bucket_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "demo_bucket_encryption" {
      + bucket = "demo-bucket-481877421625"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-east-1:481877421625:key/41be1b8d-d86c-48a8-8707-6e68963c8f45"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.demo_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "demo_bucket_versioning" {
      + bucket = "demo-bucket-481877421625"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @devbyaccident, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*